
Процедура ОтреагироватьНаСервере(Объект, ИдентификаторРеакции) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	НастройкиОбъекта = Новый Структура;
	Если Не РКЦ_Реакции.ОбъектСПодключеннымиРеакциями(МетаданныеОбъекта, НастройкиОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	//TODO: уменьшить кол-во обращений к серверу БД
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	СвойстваРеакции = РКЦ_Реакции.СвойстваРеакции(ИдентификаторРеакции);
	
	МенеджерЗаписи = РегистрыСведений.РКЦ_РеакцииОбъектов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъекта);
	МенеджерЗаписи.Идентификатор = Объект.УникальныйИдентификатор();
	МенеджерЗаписи.Пользователь  = ТекущийПользователь;
	МенеджерЗаписи.Реакция       = ?(СвойстваРеакции.Свойство("Ссылка"),
		СвойстваРеакции.Ссылка, СвойстваРеакции.Значение);
	
	МенеджерЗаписи.Записать();
	
	// Отравка оповещения
	Если ПустаяСтрока(НастройкиОбъекта.РеквизитПолучательОповещения) Тогда
		Возврат;
	КонецЕсли;
	
	// Определение адресата
	Попытка
		Адресат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, НастройкиОбъекта.РеквизитПолучательОповещения);
	Исключение
		ЗаписьЖурналаРегистрации(
			"Реакции.Отреагировать на сервере.Определение адресата уведомления",
			УровеньЖурналаРегистрации.Ошибка,
			МетаданныеОбъекта,
			НастройкиОбъекта.РеквизитПолучательОповещения,
			нСтр("ru='Ошибка получения значения реквизита с адресатом объекта реакции.'", "ru") + Символы.ПС +
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Возврат;
	КонецПопытки;
	
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адресат, "ИдентификаторПользователяИБ");
	
	СвойстваПользователя = Пользователи.СвойстваПользователяИБ(ИдентификаторПользователяИБ);
	Если СвойстваПользователя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолучатьОповещения = РКЦ_РеакцииСлужебныйПовтИсп.ПолучатьОповещения(СвойстваПользователя.Имя);
	Если Не ПолучатьОповещения Тогда
		Возврат;
	КонецЕсли;
	
	Адресаты = Новый Соответствие;
	Адресаты.Вставить(
		ИдентификаторПользователяИБ,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("*") // Все сеансы этого пользователя, видимо
	);
	
	// Формирование результата
	
	// В оповещениях картинка должна быть примерно 64*64
	// Автоматически к этому размеру не приводится
	БольшаяКартинка = СвойстваРеакции.Картинка; 
	Если БольшаяКартинка.НаборВариантов Тогда
		Варианты = Новый Соответствие();
		Варианты.Вставить("screenDensity", "udpi");// TODO: Заменить тег на wigth или height
		
		ДвоичныеДанныеБольшой = БольшаяКартинка.ПолучитьДвоичныеДанные(Ложь, Варианты);
		Если ДвоичныеДанныеБольшой <> Неопределено Тогда
			БольшаяКартинка = Новый Картинка(ДвоичныеДанныеБольшой);
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяПользователя", Строка(ТекущийПользователь));
	Результат.Вставить("Картинка",        БольшаяКартинка);
	Результат.Вставить("ПредставлениеРеакции", СвойстваРеакции.Представление);
	Результат.Вставить("ПредставлениеОбъекта", Строка(Объект));
	Результат.Вставить("URL",             ПолучитьНавигационнуюСсылку(Объект));
	
	СерверныеОповещения.ОтправитьСерверноеОповещение(
		"РКЦ_Реакции.РеакцииНаДокументыПользователя",
		Результат,
		Адресаты
	);
	
КонецПроцедуры

Процедура УдалитьРеакциюНаСервере(Объект) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РКЦ_РеакцииОбъектов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект));
	МенеджерЗаписи.Идентификатор = Объект.УникальныйИдентификатор();
	МенеджерЗаписи.Пользователь  = Пользователи.ТекущийПользователь();
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры
