
Процедура ОтреагироватьНаСервере(Объект, КодРеакции) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	//TODO: уменьшить кол-во обращений к серверу БД
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Реакция = Справочники.РКЦ_Реакции.НайтиПоКоду(КодРеакции, Истина);
	
	//Попытка
	
	МенеджерЗаписи = РегистрыСведений.РКЦ_РеакцииОбъектов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъекта);
	МенеджерЗаписи.Идентификатор = Объект.УникальныйИдентификатор();
	МенеджерЗаписи.Пользователь  = ТекущийПользователь;
	МенеджерЗаписи.Реакция       = Реакция;
	
	МенеджерЗаписи.Записать();
	
	//Исключение
	//	
	//	ЗаписьЖурналаРегистрации(
	//		"РКЦ_Реакции.Отреагировать на сервере",
	//		УровеньЖурналаРегистрации.Ошибка, , ,
	//		нСтр("ru='Ошибка записи реакции в регистр сведений.'", "ru") + Символы.ПС +
	//		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
	//	);
	//	ВызватьИсключение;
	//	
	//КонецПопытки;
	
	НастройкиРеакций = Новый Структура;
	Если Не РКЦ_Реакции.НастройкиРеакцийОбъекта(МетаданныеОбъекта.ПолноеИмя(), НастройкиРеакций) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НастройкиРеакций.РеквизитПолучательОповещения) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Адресат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, НастройкиРеакций.РеквизитПолучательОповещения);
	Исключение
		ЗаписьЖурналаРегистрации(
			"Реакции.Отреагировать на сервере.Определение адресата уведомления",
			УровеньЖурналаРегистрации.Ошибка,
			МетаданныеОбъекта,
			НастройкиРеакций.РеквизитПолучательОповещения,
			нСтр("ru='Ошибка получения значения реквизита с адресатом объекта реакции.'", "ru") + Символы.ПС +
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Возврат;
	КонецПопытки;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяПользователя", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "Наименование"));
	Результат.Вставить("Картинка",        ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реакция, "Картинка").Получить());
	Результат.Вставить("Представление",   Строка(Объект));
	Результат.Вставить("URL",             ПолучитьНавигационнуюСсылку(Объект));
	
	Адресаты = Новый Соответствие;
	Адресаты.Вставить(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адресат, "ИдентификаторПользователяИБ"),
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("*") // Все сеансы этого пользователя, видимо
	);
	
	СерверныеОповещения.ОтправитьСерверноеОповещение(
		"РКЦ_Реакции.РеакцииНаДокументыПользователя",
		Результат,
		Адресаты
	);
	
КонецПроцедуры

Процедура УдалитьРеакциюНаСервере(Объект) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РКЦ_РеакцииОбъектов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект));
	МенеджерЗаписи.Идентификатор = Объект.УникальныйИдентификатор();
	МенеджерЗаписи.Пользователь  = Пользователи.ТекущийПользователь();
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры
