
#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеТиповОбъектовСРеакциями() Экспорт
	
	ТаблицаСвойств = СвойстваОбъектов();
	
	МассивТипов = Новый Массив;
	Для Каждого ПодключенныйОбъект Из ТаблицаСвойств Цикл
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПодключенныйОбъект.Метаданные.ПолноеИмя());
		МассивТипов.Добавить(ТипЗнч(Менеджер.ПустаяСсылка()));
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(МассивТипов);
	
КонецФункции

Функция СвойстваОбъектовСРеакциями() Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого СвойстваОбъекта Из СвойстваОбъектов() Цикл
		СтруктураСвойств = Новый Структура("РеквизитПолучательОповещения");
		ЗаполнитьЗначенияСвойств(СтруктураСвойств, СвойстваОбъекта);
		Результат.Вставить(СвойстваОбъекта.Метаданные, СвойстваОбъекта);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область Свернуть

// Не используется. Сделано через СерверныеОповещения
//Функция ИдентификаторСлужебногоОбсуждения() Экспорт
//	
//	КлючОбщегоОбсуждения = "РКЦ_";
//	
//	УстановитьПривилегированныйРежим(Истина);
//	Попытка
//		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбщегоОбсуждения);
//		Создано = Ложь;
//		Если Обсуждение = Неопределено Тогда
//			Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
//			Обсуждение.Отображаемое = Ложь;
//			Обсуждение.Ключ = КлючОбщегоОбсуждения;
//			Обсуждение.Участники.Добавить(СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения);
//			Попытка
//				Обсуждение.Записать();
//				Создано = Истина;
//			Исключение
//				Создано = Ложь;
//			КонецПопытки;
//			Если Не Создано Тогда
//				СуществующееОбсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбщегоОбсуждения);
//				Если СуществующееОбсуждение <> Неопределено Тогда
//					Обсуждение = СуществующееОбсуждение;
//				Иначе
//					Обсуждение.Записать();
//					Создано = Истина;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		Если Не Создано И Обсуждение.Отображаемое Тогда
//			Обсуждение.Отображаемое = Ложь;
//			Обсуждение.Записать();
//		КонецЕсли;
//	Исключение
//		ИнформацияОбОшибке = ИнформацияОбОшибке();
//		ЗаписьЖурналаРегистрации(
//			НСтр("ru = 'Серверные оповещения.Ошибка создания общего обсуждения'",
//				ОбщегоНазначения.КодОсновногоЯзыка()),
//			УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке),,,
//			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
//		Возврат Неопределено;
//	КонецПопытки;
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	Возврат Обсуждение.Идентификатор;
//	
//КонецФункции
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвойстваОбъектов()
	
	СвойстваОбъектовПодсистемы = Новый ТаблицаЗначений;
	СвойстваОбъектовПодсистемы.Колонки.Добавить("Метаданные");
	СвойстваОбъектовПодсистемы.Колонки.Добавить("РеквизитПолучательОповещения");
	
	РКЦ_РеакцииПереопределяемый.ПриОпределенииОбъектовСРеакциями(СвойстваОбъектовПодсистемы);
	
	Возврат СвойстваОбъектовПодсистемы;
	
КонецФункции

#КонецОбласти