
&После("УстановкаПараметровСеанса")
Процедура РКЦ_УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТребуемыеПараметры.Найти("РКЦ_ПодключенныеНаборыРеакций") <> Неопределено Тогда
		НаборыРеакций = Новый Массив();
		СтандартныйНабор = Новый Структура("ИмяРасширения, Наименование, Префикс",
			"Реакции", нСтр("ru='Стандартные реакции'", "ru"), "РКЦ_");
		НаборыРеакций.Добавить(Новый ФиксированнаяСтруктура(СтандартныйНабор));
		ПараметрыСеанса.РКЦ_ПодключенныеНаборыРеакций = Новый ФиксированныйМассив(НаборыРеакций);
	КонецЕсли;
	
КонецПроцедуры
