
&После("УстановкаПараметровСеанса")
Процедура РКЦ_УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТребуемыеПараметры.Найти("РКЦ_ПодключенныеНаборыРеакций") <> Неопределено Тогда
		ПараметрыСеанса.РКЦ_ПодключенныеНаборыРеакций = Новый ФиксированныйМассив(Новый Массив);
		РКЦ_РеакцииСлужебный.ДобавитьОписаниеНабора(
			"Реакции",
			НСтр("ru='Стандартные реакции'", "ru"),
			"РКЦ_РеакцииСлужебный"
		);
	КонецЕсли;
	
КонецПроцедуры
