
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область СерверныеОповещения

Процедура ПриПолученииСерверногоОповещения(ИмяОповещения, Результат) Экспорт
	
	Если ИмяОповещения = "РКЦ_Реакции.РеакцииНаДокументыПользователя" Тогда
		ТекстСообщения = нСтр("ru='[ИмяПользователя] отреагировал на Ваш документ [Представление]'", "ru");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения, Результат);
		ПоказатьОповещениеПользователя(
			нСтр("ru='Новая реакция!'", "ru"),
			Результат.URL,
			ТекстСообщения,
			Результат.Картинка,
			//СтатусОповещенияПользователя.Важное //Не кадрирует картинку под размер в важном
			//TODO: включить, когда появятся наборы
		);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

Процедура Отреагировать(ПараметрыКоманды, ПараметрыВыполнения) Экспорт
	
	ОписаниеКоманды = ПараметрыВыполнения.ОписаниеКоманды;
	
	РКЦ_РеакцииВызовСервера.ОтреагироватьНаСервере(ПараметрыКоманды, ОписаниеКоманды.Идентификатор);
	
	ОповеститьОбИзменении(ПараметрыКоманды);
	
КонецПроцедуры

Процедура УдалитьРеакцию(ПараметрыКоманды, ПараметрыВыполнения) Экспорт
	
	РКЦ_РеакцииВызовСервера.УдалитьРеакциюНаСервере(ПараметрыКоманды);
	
	ОповеститьОбИзменении(ПараметрыКоманды);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти
