
#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеРеакцийНабора() Экспорт
	
	РеакцииНабора = Новый СписокЗначений;
	
	РеакцииНабора.Добавить("ОформлениеФлажок",   нСтр("ru='Всё хорошо'", "ru"));
	РеакцииНабора.Добавить("ОформлениеКрест",    нСтр("ru='Надо переделать'", "ru"));
	РеакцииНабора.Добавить("Провести",           нСтр("ru='Можно проводить'", "ru"));
	РеакцииНабора.Добавить("ПометитьНаУдаление", нСтр("ru='Стоит удалить'", "ru"));
	РеакцииНабора.Добавить("Найти",              нСтр("ru='Куда смотреть'", "ru"));
	
	Возврат РеакцииНабора;
	
КонецФункции

Процедура ЗаполнитьДеревоВсехРеакций(СтрокиДерева) Экспорт
	
	Для Каждого Набор Из ПараметрыСеанса.РКЦ_ПодключенныеНаборыРеакций Цикл
		
		СтрокаНабора = СтрокиДерева.Добавить();
		СтрокаНабора.Значение      = Набор.ИмяРасширения;
		СтрокаНабора.Представление = Набор.Наименование;
		
		МодульНабора = ОбщегоНазначения.ОбщийМодуль(Набор.ИмяМодуля);
		РеакцииНабора = МодульНабора.ОписаниеРеакцийНабора();
		
		СтрокиРеакций = СтрокаНабора.ПолучитьЭлементы();
		Для Каждого Реакция Из РеакцииНабора Цикл
			
			СтрокаРеакции = СтрокиРеакций.Добавить();
			СвойстваРеакции = РКЦ_Реакции.СвойстваРеакции(Реакция.Значение);
			Если СвойстваРеакции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаРеакции, СвойстваРеакции);
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборПользовательских = СтрокиДерева.Добавить();
	НаборПользовательских.Представление = нСтр("ru='Пользовательские реакции'", "ru");
	СтрокиРеакций = НаборПользовательских.ПолучитьЭлементы();
	
	ПользовательскаяРеакция = Справочники.РКЦ_Реакции.Выбрать(,,, "Наименование");
	Пока ПользовательскаяРеакция.Следующий() Цикл
		
		СтрокаРеакции = СтрокиРеакций.Добавить();
		СвойстваРеакции = РКЦ_Реакции.СвойстваРеакции(ПользовательскаяРеакция.Ссылка);
		ЗаполнитьЗначенияСвойств(СтрокаРеакции, СвойстваРеакции);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНастройкиРеакций(ПерсональныеНастройки) Экспорт
	
	ПерсональныеНастройки.Вставить("ПолучатьОповещения", РКЦ_РеакцииСлужебныйПовтИсп.ПолучатьОповещения());
	ПерсональныеНастройки.Вставить("ИспользоватьРеакции", ИспользоватьРеакции());
	ПерсональныеНастройки.Вставить("ТолькоВоВсехДействиях", ТолькоВоВсехДействиях());
	ПерсональныеНастройки.Вставить("ПоложениеКоманды", ПоложениеКоманды());
	ПерсональныеНастройки.Вставить("СписокИспользуемыхРеакций", СписокИспользуемыхРеакций());
	
КонецПроцедуры

Функция ИспользоватьРеакции() Экспорт
	
	ИспользоватьРеакции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции");
	
	Если ИспользоватьРеакции = Неопределено Тогда
		ИспользоватьРеакции = Истина;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции", ИспользоватьРеакции);
	КонецЕсли;
	
	Возврат ИспользоватьРеакции;
	
КонецФункции

Функция ТолькоВоВсехДействиях() Экспорт
	
	ТолькоВоВсехДействиях = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ТолькоВоВсехДействиях");
	
	Если ТолькоВоВсехДействиях = Неопределено Тогда
		ТолькоВоВсехДействиях = Ложь;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "ТолькоВоВсехДействиях", ТолькоВоВсехДействиях);
	КонецЕсли;
	
	Возврат ТолькоВоВсехДействиях;
	
КонецФункции

Функция ПоложениеКоманды() Экспорт
	
	ПоложениеКоманды = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды");
	
	Если ПоложениеКоманды = Неопределено Тогда
		ПоложениеКоманды = 50;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды", ПоложениеКоманды);
	КонецЕсли;
	
	Возврат ПоложениеКоманды;
	
КонецФункции

Функция СписокИспользуемыхРеакций() Экспорт
	
	СписокИспользуемыхРеакций = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций");
	
	Если СписокИспользуемыхРеакций = Неопределено 
		Или ТипЗнч(СписокИспользуемыхРеакций) <> Тип("Массив") Тогда
		СписокИспользуемыхРеакций = ОписаниеРеакцийНабора().ВыгрузитьЗначения();
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций",
			СписокИспользуемыхРеакций);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокИспользуемыхРеакций);
	
КонецФункции

Функция СтруктураСвойствРеакции(Значение = Неопределено, Представление = "") Экспорт
	
	СвойстваРеакции = Новый Структура;
	
	СвойстваРеакции.Вставить("Значение",      Значение);
	СвойстваРеакции.Вставить("Представление", Представление);
	СвойстваРеакции.Вставить("Картинка",      Новый Картинка);
	
	Возврат СвойстваРеакции;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// БиблиотекаСтандартныхПодсистем.ПодключаемыеКоманды

Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Настройки = РКЦ_Реакции.НастройкиРеакций();
	
	Если Не Настройки.ИспользоватьРеакции Тогда
		Возврат;
	КонецЕсли;
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя         = "РКЦ_Реакции";
	Вид.ИмяПодменю  = "ПодменюОтреагировать";
	Вид.Заголовок   = НСтр("ru = 'Отреагировать'");
	Вид.Картинка    = БиблиотекаКартинок.РКЦ_ПодсистемаРеакции;
	Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Вид.Порядок     = Настройки.ПоложениеКоманды;
	
КонецПроцедуры

Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Настройки = РКЦ_Реакции.НастройкиРеакций();
	Если Не Настройки.ИспользоватьРеакции Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеТипы = Новый Массив;
	Для Каждого Источник Из Источники.Строки Цикл
		Если РКЦ_Реакции.ОбъектСПодключеннымиРеакциями(Источник.ПолноеИмя) Тогда
			ДоступныеТипы.Добавить(Источник.ТипСсылкиДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеТипы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = Новый ОписаниеТипов(ДоступныеТипы);
	
	ОбщиеСвойства = Новый Структура;
	ОбщиеСвойства.Вставить("Вид",                   "РКЦ_Реакции");
	ОбщиеСвойства.Вставить("ТолькоВоВсехДействиях", Настройки.ТолькоВоВсехДействиях);
	ОбщиеСвойства.Вставить("МножественныйВыбор",    Ложь);
	ОбщиеСвойства.Вставить("РежимЗаписи",           "НеЗаписывать");
	ОбщиеСвойства.Вставить("ТипПараметра",          ТипПараметра);
	ОбщиеСвойства.Вставить("Важность",              "Важное");
	
	СписокИспользуемыхРеакций = Настройки.СписокИспользуемыхРеакций;
	Если СписокИспользуемыхРеакций.Количество() > 0 Тогда
		
		Порядок = 1;
		
		Для Каждого Идентификатор Из СписокИспользуемыхРеакций Цикл
			
			КомандаРеакции = Команды.Добавить();
			КомандаРеакции.ФункциональныеОпции = "";//TODO: Опциональные пользовательские
			
			СвойстваРеакции = РКЦ_Реакции.СвойстваРеакции(Идентификатор);
			Если СвойстваРеакции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(КомандаРеакции, ОбщиеСвойства);
			КомандаРеакции.Идентификатор = СвойстваРеакции.Значение;
			КомандаРеакции.Представление = СвойстваРеакции.Представление;
			Картинка = СвойстваРеакции.Картинка;
			Если Картинка.Вид <> ВидКартинки.Абсолютная Тогда // Ограничение платформы 8.3.27.1606
				КомандаРеакции.Картинка = Картинка;
			КонецЕсли;
			КомандаРеакции.Обработчик = "РКЦ_РеакцииКлиент.Отреагировать";
			КомандаРеакции.Важность = "Важное";
			КомандаРеакции.ТипПараметра = ТипПараметра;
			КомандаРеакции.Порядок = Порядок;
			
			Порядок = Порядок + 1;
			Если Порядок = 100 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщиеСвойства.Вставить("Важность", "СмТакже");
	
	КомандаВсе = Команды.Добавить();
	ЗаполнитьЗначенияСвойств(КомандаВсе, ОбщиеСвойства);
	КомандаВсе.Представление = нСтр("ru='Все реакции...'", "ru");
	КомандаВсе.Обработчик    = "РКЦ_РеакцииКлиент.ВыбратьИзВсехРеакций";
	
	КомандаУдалить = Команды.Добавить();
	ЗаполнитьЗначенияСвойств(КомандаУдалить, ОбщиеСвойства);
	КомандаУдалить.Представление = нСтр("ru='Удалить реакцию'", "ru");
	КомандаУдалить.Обработчик    = "РКЦ_РеакцииКлиент.УдалитьРеакцию";
	КомандаУдалить.Картинка      = БиблиотекаКартинок.ЗакрытьОтборДинамическогоСписка;
	
КонецПроцедуры

// БиблиотекаСтандартныхПодсистем.СерверныеОповещения

Процедура ПриДобавленииСерверныхОповещений(Оповещения) Экспорт
	
	Оповещение = СерверныеОповещения.НовоеСерверноеОповещение(
		"РКЦ_Реакции.РеакцииНаДокументыПользователя");
	//Оповещение.ИмяМодуляОтправки  = "РКЦ_Реакции";
	Оповещение.ИмяМодуляПолучения = "РКЦ_РеакцииКлиент";
	Оповещение.ПериодПроверки = 20;
	
	Оповещения.Вставить(Оповещение.Имя, Оповещение);
	
КонецПроцедуры

// Не используется
Процедура ПриОтправкеСерверногоОповещения(ИмяОповещения, ВариантыПараметров) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
