
#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеРеакцийНабора() Экспорт
	
	РеакцииНабора = Новый Соответствие;
	
	РеакцииНабора.Вставить("ОформлениеФлажок",   нСтр("ru='Всё хорошо'", "ru"));
	РеакцииНабора.Вставить("ОформлениеКрест",    нСтр("ru='Надо переделать'", "ru"));
	РеакцииНабора.Вставить("Провести",           нСтр("ru='Можно проводить'", "ru"));
	РеакцииНабора.Вставить("ПометитьНаУдаление", нСтр("ru='Стоит удалить'", "ru"));
	РеакцииНабора.Вставить("Найти",              нСтр("ru='Куда смотреть'", "ru"));
	
	Возврат РеакцииНабора;
	
КонецФункции

Процедура ЗаполнитьДеревоВсехРеакций(СтрокиДерева) Экспорт
	
	СтрокиНаборов = Новый Соответствие;
	
	ДанныеРеакций = РКЦ_РеакцииСлужебныйПовтИсп.ДанныеРеакций();
	
	Для Каждого СвойстваРеакции Из ДанныеРеакций.ПредопределенныеРеакции Цикл
		Свойства = СвойстваРеакции.Значение;
		
		Набор = СтрокиНаборов.Получить(Свойства.ДанныеНабора.ИмяРасширения);
		Если Набор = Неопределено Тогда
			Набор = СтрокиДерева.Добавить();
			Набор.Представление = Свойства.ДанныеНабора.Наименование;
			СтрокиНаборов.Вставить(Свойства.ДанныеНабора.ИмяРасширения, Набор);
		КонецЕсли;
		
		СтрокаРеакции = Набор.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРеакции, Свойства);
	КонецЦикла;
	
	НаборПользовательских = СтрокиДерева.Добавить();
	НаборПользовательских.Представление = нСтр("ru='Пользовательские реакции'", "ru");
	Для Каждого СвойстваРеакции Из ДанныеРеакций.ПользовательскиеРеакции Цикл
		СтрокаРеакции = НаборПользовательских.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРеакции, СвойстваРеакции.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНастройкиРеакций(ПерсональныеНастройки) Экспорт
	
	ПерсональныеНастройки.Вставить("ПолучатьОповещения", РКЦ_РеакцииСлужебныйПовтИсп.ПолучатьОповещения());
	ПерсональныеНастройки.Вставить("ИспользоватьРеакции", ИспользоватьРеакции());
	ПерсональныеНастройки.Вставить("РасполагатьКомандуТолькоВоВсехДействиях",
		РасполагатьКомандуТолькоВоВсехДействиях());
	ПерсональныеНастройки.Вставить("ПоложениеКоманды", ПоложениеКоманды());
	ПерсональныеНастройки.Вставить("СписокИспользуемыхРеакций", СписокИспользуемыхРеакций());
	
КонецПроцедуры

Функция ИспользоватьРеакции() Экспорт
	
	ИспользоватьРеакции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции");
	
	Если ИспользоватьРеакции = Неопределено Тогда
		ИспользоватьРеакции = Истина;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции", ИспользоватьРеакции);
	КонецЕсли;
	
	Возврат ИспользоватьРеакции;
	
КонецФункции

Функция РасполагатьКомандуТолькоВоВсехДействиях() Экспорт
	
	ТолькоВоВсехДействиях = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "РасполагатьКомандуТолькоВоВсехДействиях");
	
	Если ТолькоВоВсехДействиях = Неопределено Тогда
		ТолькоВоВсехДействиях = Ложь;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "РасполагатьКомандуТолькоВоВсехДействиях", ТолькоВоВсехДействиях);
	КонецЕсли;
	
	Возврат ТолькоВоВсехДействиях;
	
КонецФункции

Функция ПоложениеКоманды() Экспорт
	
	ПоложениеКоманды = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды");
	
	Если ПоложениеКоманды = Неопределено Тогда
		ПоложениеКоманды = 50;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды", ПоложениеКоманды);
	КонецЕсли;
	
	Возврат ПоложениеКоманды;
	
КонецФункции

Функция СписокИспользуемыхРеакций() Экспорт
	
	СписокИспользуемыхРеакций = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций");
	
	Если СписокИспользуемыхРеакций = Неопределено 
		Или ТипЗнч(СписокИспользуемыхРеакций) <> Тип("Массив") Тогда
		СписокИспользуемыхРеакций = Новый Массив;
		Для Каждого КлючИЗначение Из ОписаниеРеакцийНабора() Цикл
			СписокИспользуемыхРеакций.Вставить(0, КлючИЗначение.Ключ);
		КонецЦикла;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций",
			СписокИспользуемыхРеакций);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокИспользуемыхРеакций);
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// БиблиотекаСтандартныхПодсистем.ПодключаемыеКоманды

Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	ИспользоватьРеакции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции"
	);
	Если Не ИспользоватьРеакции Тогда
		Возврат;
	КонецЕсли;
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя         = "РКЦ_Реакции";
	Вид.ИмяПодменю  = "ПодменюОтреагировать";
	Вид.Заголовок   = НСтр("ru = 'Отреагировать'");
	Вид.Картинка    = БиблиотекаКартинок.РКЦ_ПодсистемаРеакции;
	Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Вид.Порядок     = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды", 50
	);
	
КонецПроцедуры

Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	ИспользоватьРеакции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции", Истина
	);
	Если Не ИспользоватьРеакции Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеТипы = Новый Массив;
	Для Каждого Источник Из Источники.Строки Цикл
		Если РКЦ_Реакции.ОбъектСПодключеннымиРеакциями(Источник.ПолноеИмя) Тогда
			ДоступныеТипы.Добавить(Источник.ТипСсылкиДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеТипы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = Новый ОписаниеТипов(ДоступныеТипы);
	
	ТолькоВоВсехДействиях = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "РасполагатьКомандуТолькоВБыстрыхДействиях", Истина
	);
	
	ОбщиеСвойства = Новый Структура;
	ОбщиеСвойства.Вставить("Вид",                   "РКЦ_Реакции");
	ОбщиеСвойства.Вставить("ТолькоВоВсехДействиях", ТолькоВоВсехДействиях);
	ОбщиеСвойства.Вставить("МножественныйВыбор",    Ложь);
	ОбщиеСвойства.Вставить("РежимЗаписи",           "НеЗаписывать");
	ОбщиеСвойства.Вставить("ТипПараметра",          ТипПараметра);
	ОбщиеСвойства.Вставить("Важность",              "Важное");
	
	СписокИспользуемыхРеакций = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций", Новый Массив
	);
	
	Если СписокИспользуемыхРеакций.Количество() > 0 Тогда
		
		Для Каждого Идентификатор Из СписокИспользуемыхРеакций Цикл
			
			КомандаРеакции = Команды.Добавить();
			КомандаРеакции.ФункциональныеОпции = "";//TODO: Опциональные пользовательские
			
			СвойстваРеакции = РКЦ_Реакции.СвойстваРеакции(Идентификатор);
			Если СвойстваРеакции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(КомандаРеакции, ОбщиеСвойства);
			КомандаРеакции.Идентификатор = СвойстваРеакции.Значение;
			КомандаРеакции.Представление = СвойстваРеакции.Представление;
			Картинка = СвойстваРеакции.Картинка;
			Если Картинка.Вид <> ВидКартинки.Абсолютная Тогда // Ограничение платформы 8.3.27.1606
				КомандаРеакции.Картинка = Картинка;
			КонецЕсли;
			КомандаРеакции.Обработчик = "РКЦ_РеакцииКлиент.Отреагировать";
			КомандаРеакции.Важность = "Важное";
			КомандаРеакции.ТипПараметра = ТипПараметра;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщиеСвойства.Вставить("Важность", "СмТакже");
	
	КомандаВсе = Команды.Добавить();
	ЗаполнитьЗначенияСвойств(КомандаВсе, ОбщиеСвойства);
	КомандаВсе.Представление = нСтр("ru='Все реакции...'", "ru");
	КомандаВсе.Обработчик    = "РКЦ_РеакцииКлиент.ВыбратьИзВсехРеакций";
	
	КомандаУдалить = Команды.Добавить();
	ЗаполнитьЗначенияСвойств(КомандаУдалить, ОбщиеСвойства);
	КомандаУдалить.Представление = нСтр("ru='Удалить реакцию'", "ru");
	КомандаУдалить.Обработчик    = "РКЦ_РеакцииКлиент.УдалитьРеакцию";
	КомандаУдалить.Картинка      = БиблиотекаКартинок.ЗакрытьОтборДинамическогоСписка;
	
КонецПроцедуры

// БиблиотекаСтандартныхПодсистем.СерверныеОповещения

// Не используется
Процедура ПриОтправкеСерверногоОповещения(ИмяОповещения, ВариантыПараметров) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
