
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ЗначениеЗаполнено(Запись.ИдентификаторОбъектаМетаданных) Тогда
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Запись.ИдентификаторОбъектаМетаданных.ПолноеИмя);
		Объект = Менеджер.ПолучитьСсылку(Запись.Идентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Идентификатор = Объект.УникальныйИдентификатор();
КонецПроцедуры

&НаСервере
Процедура ИдентификаторОбъектаМетаданныхПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.ИдентификаторОбъектаМетаданных) Тогда
		Объект = Запись.ИдентификаторОбъектаМетаданных.ЗначениеПустойСсылки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОбъектаМетаданныхПриИзменении(Элемент)
	ИдентификаторОбъектаМетаданныхПриИзмененииНаСервере();
КонецПроцедуры
