
Процедура ПриПолученииДанныхНаСервере() Экспорт
	
	Х = 
	"ВЫБРАТЬ
	|	РеакцииОбъектов.Объект КАК Объект,
	|	РеакцииОбъектов.Реакция КАК Реакция,
	|	КОЛИЧЕСТВО(РеакцииОбъектов.Реакция) КАК Число
	|ПОМЕСТИТЬ РеакцииОбъекта
	|ИЗ
	|	РегистрСведений.РКЦ_РеакцииОбъектов КАК РеакцииОбъектов
	|ГДЕ
	|	РеакцииОбъектов.Пользователь = &ТекущийПользователь
	|	И РеакцииОбъектов.Объект В(&Объекты)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеакцииОбъектов.Объект,
	|	РеакцииОбъектов.Реакция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеакцииОбъекта.Объект КАК Объект,
	|	РеакцииОбъекта.Число КАК Число,
	|	РКЦ_Реакции.Ссылка КАК Ссылка,
	|	РКЦ_Реакции.Картинка КАК Картинка,
	|	РКЦ_Реакции.Наименование КАК Наименование
	|ИЗ
	|	РеакцииОбъекта КАК РеакцииОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РКЦ_Реакции КАК РКЦ_Реакции
	|		ПО РеакцииОбъекта.Реакция = РКЦ_Реакции.Ссылка
	|ИТОГИ ПО
	|	Объект";
	
КонецПроцедуры