
#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеРеакцийНабора() Экспорт
	
	РеакцииНабора = Новый Соответствие;
	
	РеакцииНабора.Вставить("ОформлениеФлажок",   нСтр("ru='Всё хорошо'", "ru"));
	РеакцииНабора.Вставить("ОформлениеКрест",    нСтр("ru='Надо переделать'", "ru"));
	РеакцииНабора.Вставить("Провести",           нСтр("ru='Можно проводить'", "ru"));
	РеакцииНабора.Вставить("ПометитьНаУдаление", нСтр("ru='Стоит удалить'", "ru"));
	РеакцииНабора.Вставить("Найти",              нСтр("ru='Куда смотреть'", "ru"));
	
	Возврат РеакцииНабора;
	
КонецФункции

#КонецОбласти
