#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	СтрокиДерева = ВсеРеакции.ПолучитьЭлементы();
	РКЦ_РеакцииСлужебный.ЗаполнитьДеревоВсехРеакций(СтрокиДерева);
	
	НастройкиРеакций = РКЦ_Реакции.НастройкиРеакций();
	
	ПолучатьОповещения        = НастройкиРеакций["ПолучатьОповещения"];
	ИспользоватьРеакции       = НастройкиРеакций["ИспользоватьРеакции"];
	РасполагатьКомандуТолькоВоВсехДействиях = НастройкиРеакций["РасполагатьКомандуТолькоВоВсехДействиях"];
	ПоложениеКоманды          = НастройкиРеакций["ПоложениеКоманды"];
	СписокИспользуемыхРеакций = НастройкиРеакций["СписокИспользуемыхРеакций"];
	
	Для Каждого ИдентификаторРеакции Из СписокИспользуемыхРеакций Цикл
		ИспользуемаяРеакция = ИспользуемыеРеакции.Добавить();
		СвойстваРеакции = РКЦ_Реакции.СвойстваРеакции(ИдентификаторРеакции);
		ЗаполнитьЗначенияСвойств(ИспользуемаяРеакция, СвойстваРеакции);
	КонецЦикла;
	
	НастроитьВидимостьКомандИспользованиеРеакций(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьОповещение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьРеакцииПриИзменении(Элемент)
	
	НастроитьВидимостьКомандИспользованиеРеакций(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ВсеРеакцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьРеакции();
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемыеРеакцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	УдалитьРеакцию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьИспользуемыеРеакции(Команда)
	ДобавитьРеакции();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИспользуемуюРеакцию(Команда)
	УдалитьРеакцию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьКомандИспользованиеРеакций(Форма)
	
	Элементы = Форма.Элементы;
	
	ИспользоватьРеакции = Форма.ИспользоватьРеакции;
	
	Элементы.ГруппаРасположенияКоманды.Доступность = ИспользоватьРеакции;
	Элементы.ГруппаИспользуемыеРеакции.Доступность = ИспользоватьРеакции;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеакции()
	
	ТекущаяРеакция = ВсеРеакции.НайтиПоИдентификатору(Элементы.ВсеРеакции.ТекущаяСтрока);
	
	Если ТекущаяРеакция.ПолучитьЭлементы().Количество() = 0 Тогда
		ДобавитьРеакцию(ТекущаяРеакция);
	Иначе
		Для Каждого Элемент Из ТекущаяРеакция.ПолучитьЭлементы() Цикл
			ДобавитьРеакцию(Элемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеакцию(ТекущаяРеакция)
	
	Если ИспользуемыеРеакции.НайтиПоЗначению(ТекущаяРеакция.Значение) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуемаяРеакция = ИспользуемыеРеакции.Добавить();
	ЗаполнитьЗначенияСвойств(ИспользуемаяРеакция, ТекущаяРеакция);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРеакцию()
	
	ТекущаяСтрока = Элементы.ИспользуемыеРеакции.ТекущаяСтрока;
	ИспользуемыеРеакции.Удалить(ИспользуемыеРеакции.НайтиПоИдентификатору(ТекущаяСтрока));
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНастройкиИЗакрытьФорму();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиИЗакрытьФорму()
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ПерсональныеНастройки = Новый Структура;
	ПерсональныеНастройки.Вставить("ПолучатьОповещения",        ПолучатьОповещения);
	ПерсональныеНастройки.Вставить("ИспользоватьРеакции",       ИспользоватьРеакции);
	ПерсональныеНастройки.Вставить("РасполагатьКомандуТолькоВБыстрыхДействиях", РасполагатьКомандуТолькоВоВсехДействиях);
	ПерсональныеНастройки.Вставить("ПоложениеКоманды",          ПоложениеКоманды);
	СписокИспользуемыхРеакций = ИспользуемыеРеакции.ВыгрузитьЗначения();
	ПерсональныеНастройки.Вставить("СписокИспользуемыхРеакций", СписокИспользуемыхРеакций);
	
	РКЦ_Реакции.СохранитьНастройкиРеакций(ПерсональныеНастройки);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьОповещение()
	СохранитьНастройкиИЗакрытьФорму();
КонецПроцедуры

#КонецОбласти
