
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	СтрокиДерева = ВсеРеакции.ПолучитьЭлементы();
	РКЦ_Реакции.ЗаполнитьДеревоВсехРеакций(СтрокиДерева);
	
	ПолучатьОповещения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПолучатьОповещения"
	);
	ИспользоватьРеакции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции"
	);
	РасполагатьКомандуТолькоВБыстрыхДействиях = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "РасполагатьКомандуТолькоВБыстрыхДействиях"
	);
	ПоложениеКоманды = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды"
	);
	СписокИспользуемыхРеакций = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций", Новый Массив
	);
	
	ДанныеРеакций = РКЦ_РеакцииСлужебныйПовтИсп.ДанныеРеакций();
	Для Каждого ИдентификаторРеакции Из СписокИспользуемыхРеакций Цикл
		
		ИспользуемаяРеакция = ИспользуемыеРеакции.Добавить();
		
		СвойстваРеакции = РКЦ_Реакции.СвойстваРеакции(ИдентификаторРеакции, ДанныеРеакций);
		
		ЗаполнитьЗначенияСвойств(ИспользуемаяРеакция, СвойстваРеакции);
		
	КонецЦикла;
	
	НастроитьВидимостьКомандИспользованиеРеакций(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИспользуемыеРеакции(Команда)
	
	ТекущаяРеакция = ВсеРеакции.НайтиПоИдентификатору(Элементы.ВсеРеакции.ТекущаяСтрока);
	
	Если ТекущаяРеакция.ПолучитьЭлементы().Количество() = 0 Тогда
		ДобавитьИспользуемуюРеакцию(ТекущаяРеакция);
	Иначе
		Для Каждого Элемент Из ТекущаяРеакция.ПолучитьЭлементы() Цикл
			ДобавитьИспользуемуюРеакцию(Элемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИспользуемуюРеакцию(ТекущаяРеакция)
	
	Если ИспользуемыеРеакции.НайтиПоЗначению(ТекущаяРеакция.Значение) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуемаяРеакция = ИспользуемыеРеакции.Добавить();
	ЗаполнитьЗначенияСвойств(ИспользуемаяРеакция, ТекущаяРеакция);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИспользуемуюРеакцию(Команда)
	
	ТекущаяСтрока = Элементы.ИспользуемыеРеакции.ТекущаяСтрока;
	ИспользуемыеРеакции.Удалить(ИспользуемыеРеакции.НайтиПоИдентификатору(ТекущаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПолучатьОповещения", ПолучатьОповещения
	);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции", ИспользоватьРеакции
	);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "РасполагатьКомандуТолькоВБыстрыхДействиях", РасполагатьКомандуТолькоВБыстрыхДействиях
	);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды", ПоложениеКоманды
	);
	СписокИспользуемыхРеакций = ИспользуемыеРеакции.ВыгрузитьЗначения();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций", СписокИспользуемыхРеакций
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРеакцииПриИзменении(Элемент)
	
	НастроитьВидимостьКомандИспользованиеРеакций(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьКомандИспользованиеРеакций(Форма)
	
	Элементы = Форма.Элементы;
	
	ИспользоватьРеакции = Форма.ИспользоватьРеакции;
	
	Элементы.ГруппаРасположенияКоманды.Доступность = ИспользоватьРеакции;
	Элементы.ГруппаИспользуемыеРеакции.Доступность = ИспользоватьРеакции;
	
КонецПроцедуры