
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокиДерева = ВсеРеакции.ПолучитьЭлементы();
	РКЦ_Реакции.ЗаполнитьДеревоВсехРеакций(СтрокиДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура Отреагировать(Команда)
	ВыбратьРеакцию();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьРеакцию();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРеакцию()
	
	ТекущаяРеакция = ВсеРеакции.НайтиПоИдентификатору(Элементы.ВсеРеакции.ТекущаяСтрока);
	
	Если ТекущаяРеакция.Свойство("Значение")
		И ЗначениеЗаполнено(ТекущаяРеакция.Значение) Тогда
		
		Закрыть(ТекущаяРеакция.Значение);
		
	КонецЕсли;
	
КонецПроцедуры
