
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокиДерева = ВсеРеакции.ПолучитьЭлементы();
	РКЦ_РеакцииСлужебный.ЗаполнитьДеревоВсехРеакций(СтрокиДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура Отреагировать(Команда)
	ВыбратьРеакцию();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьРеакцию();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРеакцию()
	
	ОчиститьСообщения();
	
	ТекущаяРеакция = ВсеРеакции.НайтиПоИдентификатору(Элементы.ВсеРеакции.ТекущаяСтрока);
	
	Если ТекущаяРеакция.ПолучитьЭлементы().Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(нСтр("ru='Выберете конкретную реакцию из набора'", "ru"));
		Возврат;
	КонецЕсли;
	
	Закрыть(ТекущаяРеакция.Значение);
	
КонецПроцедуры
