
#Область ПрограммныйИнтерфейс

// ПриСозданииНаСервере
Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения) Экспорт
	
	ЭтоФормаСписка = Ложь;
	Параметры = Форма.Параметры;
	ЕстьПараметрыСписка = Параметры.Свойство("Отбор") И Параметры.Свойство("ТекущаяСтрока");
	Если ЕстьПараметрыСписка Тогда
		ЭтоФормаСписка = Истина;
	КонецЕсли;
	//
	//РеквизитИнициализирован = Новый РеквизитФормы("РКЦ_Инициализирован", Новый ОписаниеТипов("Булево"));
	//Форма.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитИнициализирован));
	//Форма.РКЦ_Инициализирован = Ложь;
	
	Если ЭтоФормаСписка Тогда
		
		ПереданныеПараметры = ПараметрыРазмещения;
		ПараметрыРазмещения = ПараметрыРазмещения();
		ЗаполнитьЗначенияСвойств(ПараметрыРазмещения, ПереданныеПараметры);
		
		ТаблицаСписка = ПараметрыРазмещения.ПолеИлиТаблица;
		ПолеСписка = Неопределено;
		Если ТипЗнч(ТаблицаСписка) = Тип("ПолеФормы") Тогда
			ПолеСписка = ПараметрыРазмещения.ПолеИлиТаблица;
			ТаблицаСписка = ПолеСписка.Родитель;
		КонецЕсли;
		
		Если ТипЗнч(ТаблицаСписка) <> Тип("ТаблицаФормы")
			Или ТипЗнч(Форма[ТаблицаСписка.ПутьКДанным]) <> Тип("ДинамическийСписок") Тогда
			//TODO: Нормальную проверку параметра
			ВызватьИсключение "Некорректно заполнены параметры размещения на форме списка";
		КонецЕсли;
		
		// Добавление колонки динамического списка
		ДинамическийСписок = Форма[ТаблицаСписка.ПутьКДанным];
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		ЗаполнитьЗначенияСвойств(СвойстваСписка, ДинамическийСписок);
		
		Если Не ЗначениеЗаполнено(СвойстваСписка.ОсновнаяТаблица)
			Или Не ОбъектСПодключеннымиРеакциями(СвойстваСписка.ОсновнаяТаблица) Тогда
			Возврат;
		КонецЕсли;
		
		Если ДинамическийСписок.ПроизвольныйЗапрос Тогда
			
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(СвойстваСписка.ТекстЗапроса);
			Для Каждого ПакетЗапросов ИЗ СхемаЗапроса.ПакетЗапросов Цикл
				Если ПакетЗапросов.ТаблицаДляПомещения = "" Тогда
					ЗапросВыбора = ПакетЗапросов;
				КонецЕсли;
			КонецЦикла;
			ОператорВыбора = ЗапросВыбора.Операторы[0];
			Выражение = ОператорВыбора.ВыбираемыеПоля.Добавить("NULL");
			ЗапросВыбора.Колонки.Найти(Выражение).Псевдоним = "РКЦ_Реакции";
			СвойстваСписка.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(ТаблицаСписка, СвойстваСписка);
			
			МассивПолейСОграничениями = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("РКЦ_Реакции");
			ДинамическийСписок.УстановитьОграниченияИспользованияВГруппировке(МассивПолейСОграничениями);
			ДинамическийСписок.УстановитьОграниченияИспользованияВОтборе     (МассивПолейСОграничениями);
			ДинамическийСписок.УстановитьОграниченияИспользованияВПорядке    (МассивПолейСОграничениями);
			//
			//Форма.РКЦ_Инициализирован = Истина;
			
		Иначе
			
			ТекстСообщения = нСтр("ru='Не поддерживается вывод реакций в список с непроизвольным запросом'", "ru");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
			
		КонецЕсли;
		
		// Добавление поля таблицы
		ПолеРеакций = Форма.Элементы.Вставить(ТаблицаСписка.Имя + "РКЦ_Реакции", Тип("ПолеФормы"), ТаблицаСписка, ПолеСписка);
		ПолеРеакций.Вид              = ВидПоляФормы.ПолеВвода;
		ПолеРеакций.ПутьКДанным      = ТаблицаСписка.ПутьКДанным + ".РКЦ_Реакции";
		ПолеРеакций.Заголовок        = нСтр("ru='Реакции'", "ru");
		ПолеРеакций.АвтоВысотаЯчейки = Истина;
		ПолеРеакций.Доступность      = Ложь;
		ПолеРеакций.Ширина           = 23;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыРазмещения() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ПолеИлиТаблица");
	Возврат Результат;
	
КонецФункции

Процедура ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	Перем КлючСтроки;
	
	Для Каждого Строка Из Строки Цикл
		КлючСтроки = Строка.Ключ;
		Прервать;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(КлючСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = КлючСтроки.Метаданные();
	Если Не ОбъектСПодключеннымиРеакциями(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеакцииОбъектов.Идентификатор КАК Идентификатор,
	|	РеакцииОбъектов.Реакция КАК Реакция,
	|	КОЛИЧЕСТВО(РеакцииОбъектов.Реакция) КАК Число,
	|	МАКСИМУМ(РеакцииОбъектов.Пользователь = &ТекущийПользователь) КАК Наша
	|ПОМЕСТИТЬ РеакцииОбъекта
	|ИЗ
	|	РегистрСведений.РКЦ_РеакцииОбъектов КАК РеакцииОбъектов
	|ГДЕ
	|	РеакцииОбъектов.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных
	|		И РеакцииОбъектов.Идентификатор В(&Идентификаторы)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеакцииОбъектов.Идентификатор,
	|	РеакцииОбъектов.Реакция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеакцииОбъекта.Идентификатор КАК Идентификатор,
	|	РеакцииОбъекта.Число КАК Число,
	|	РеакцииОбъекта.Наша КАК ЕстьНаша,
	|	РеакцииОбъекта.Реакция КАК Реакция,
	|	РКЦ_Реакции.Ссылка ЕСТЬ НЕ NULL КАК ЭтоПользовательская
	|ИЗ
	|	РеакцииОбъекта КАК РеакцииОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РКЦ_Реакции КАК РКЦ_Реакции
	|		ПО РеакцииОбъекта.Реакция = РКЦ_Реакции.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(ЕстьНаша)
	|ПО
	|	Идентификатор";
	
	Идентификаторы = Новый Массив;
	Для Каждого Ключ Из Строки.ПолучитьКлючи() Цикл
		Идентификаторы.Добавить(Ключ.УникальныйИдентификатор());
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектов.Следующий() Цикл
		
		СтрокаСписка = Строки[Менеджер.ПолучитьСсылку(ВыборкаОбъектов.Идентификатор)];
		
		СписокРеакций = Новый СписокЗначений;
		ВыборкаРеакций = ВыборкаОбъектов.Выбрать();
		Пока ВыборкаРеакций.Следующий() Цикл
			
			СвойстваРеакции = СвойстваРеакции(ВыборкаРеакций.Реакция);
			
			Если СвойстваРеакции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СписокРеакций.Добавить(
				СвойстваРеакции.Представление,
				ВыборкаРеакций.Число, ,
				СвойстваРеакции.Картинка
			);
			
		КонецЦикла;
		
		Если СтрокаСписка.Данные.Свойство("РКЦ_Реакции") Тогда
			СтрокаСписка.Данные["РКЦ_Реакции"] = СписокРеакций;
			СтрокаСписка.Оформление["РКЦ_Реакции"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПоля);
			Если ВыборкаОбъектов.ЕстьНаша Тогда
				СтрокаСписка.Оформление["РКЦ_Реакции"].УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонАктивногоВариантаВторой);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Функция ОбъектСПодключеннымиРеакциями(Знач Объект, Настройки = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		Объект = Метаданные.НайтиПоПолномуИмени(Объект);
	КонецЕсли;
	
	Настройки = РКЦ_РеакцииСлужебныйПовтИсп.ОбъектыСРеакциями()[Объект];
	Возврат Настройки <> Неопределено;
	
КонецФункции

Функция СвойстваРеакции(Знач Идентификатор) Экспорт
	
	ДанныеРеакций = РКЦ_РеакцииСлужебныйПовтИсп.ДанныеРеакций();
	
	Если ТипЗнч(Идентификатор) = Тип("СправочникСсылка.РКЦ_Реакции") Тогда
		Идентификатор = Строка(Идентификатор.УникальныйИдентификатор());
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		Возврат ДанныеРеакций.ПользовательскиеРеакции[Идентификатор];
	Иначе
		Возврат ДанныеРеакций.ПредопределенныеРеакции[Идентификатор];
	КонецЕсли;
	
КонецФункции

Функция НастройкиРеакций() Экспорт
	
	Возврат РКЦ_РеакцииСлужебныйПовтИсп.НастройкиРеакций();
	
КонецФункции

Процедура СохранитьНастройкиРеакций(ПерсональныеНастройки) Экспорт
	
	Для Каждого Настройка Из ПерсональныеНастройки Цикл
		
		Если Настройка.Ключ = "ПоложениеКоманды" Тогда
			Если Настройка.Значение > 100 Тогда
				ПерсональныеНастройки.ПоложениеКоманды = 100;
			КонецЕсли;
			Если Настройка.Значение < 1 Тогда
				ПерсональныеНастройки.ПоложениеКоманды = 1;
			КонецЕсли;
		КонецЕсли;
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", Настройка.Ключ, Настройка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
