
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения) Экспорт
	
	ЭтоФормаСписка = Ложь;
	Параметры = Форма.Параметры;
	ЕстьПараметрыСписка = Параметры.Свойство("Отбор") И Параметры.Свойство("ТекущаяСтрока");
	Если ЕстьПараметрыСписка Тогда
		ЭтоФормаСписка = Истина;
	КонецЕсли;
	//
	//РеквизитИнициализирован = Новый РеквизитФормы("РКЦ_Инициализирован", Новый ОписаниеТипов("Булево"));
	//Форма.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитИнициализирован));
	//Форма.РКЦ_Инициализирован = Ложь;
	
	Если ЭтоФормаСписка Тогда
		
		ПереданныеПараметры = ПараметрыРазмещения;
		ПараметрыРазмещения = ПараметрыРазмещения();
		ЗаполнитьЗначенияСвойств(ПараметрыРазмещения, ПереданныеПараметры);
		
		ТаблицаСписка = ПараметрыРазмещения.ПолеИлиТаблица;
		ПолеСписка = Неопределено;
		Если ТипЗнч(ТаблицаСписка) = Тип("ПолеФормы") Тогда
			ПолеСписка = ПараметрыРазмещения.ПолеИлиТаблица;
			ТаблицаСписка = ПолеСписка.Родитель;
		КонецЕсли;
		
		Если ТипЗнч(ТаблицаСписка) <> Тип("ТаблицаФормы")
			Или ТипЗнч(Форма[ТаблицаСписка.ПутьКДанным]) <> Тип("ДинамическийСписок") Тогда
			//TODO: Нормальную проверку параметра
			ВызватьИсключение "Некорректно заполнены параметры размещения на форме списка";
		КонецЕсли;
		
		// Добавление колонки динамического списка
		ДинамическийСписок = Форма[ТаблицаСписка.ПутьКДанным];
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		ЗаполнитьЗначенияСвойств(СвойстваСписка, ДинамическийСписок);
		
		Если Не ЗначениеЗаполнено(СвойстваСписка.ОсновнаяТаблица)
			Или Не РКЦ_Реакции.НастройкиРеакцийОбъекта(СвойстваСписка.ОсновнаяТаблица) Тогда
			Возврат;
		КонецЕсли;
		
		Если ДинамическийСписок.ПроизвольныйЗапрос Тогда
			
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(СвойстваСписка.ТекстЗапроса);
			Для Каждого ПакетЗапросов ИЗ СхемаЗапроса.ПакетЗапросов Цикл
				Если ПакетЗапросов.ТаблицаДляПомещения = "" Тогда
					ЗапросВыбора = ПакетЗапросов;
				КонецЕсли;
			КонецЦикла;
			ОператорВыбора = ЗапросВыбора.Операторы[0];
			Выражение = ОператорВыбора.ВыбираемыеПоля.Добавить("NULL");
			ЗапросВыбора.Колонки.Найти(Выражение).Псевдоним = "РКЦ_Реакции";
			СвойстваСписка.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(ТаблицаСписка, СвойстваСписка);
			
			МассивПолейСОграничениями = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("РКЦ_Реакции");
			ДинамическийСписок.УстановитьОграниченияИспользованияВГруппировке(МассивПолейСОграничениями);
			ДинамическийСписок.УстановитьОграниченияИспользованияВОтборе     (МассивПолейСОграничениями);
			ДинамическийСписок.УстановитьОграниченияИспользованияВПорядке    (МассивПолейСОграничениями);
			//
			//Форма.РКЦ_Инициализирован = Истина;
			
		Иначе
			
			ТекстСообщения = нСтр("ru='Не поддерживается вывод реакций в список с непроизвольным запросом'", "ru");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
			
		КонецЕсли;
		
		// Добавление поля таблицы
		ПолеРеакций = Форма.Элементы.Вставить(ТаблицаСписка.Имя + "РКЦ_Реакции", Тип("ПолеФормы"), ТаблицаСписка, ПолеСписка);
		ПолеРеакций.Вид              = ВидПоляФормы.ПолеВвода;
		ПолеРеакций.ПутьКДанным      = ТаблицаСписка.ПутьКДанным + ".РКЦ_Реакции";
		ПолеРеакций.Заголовок        = нСтр("ru='Реакции'", "ru");
		ПолеРеакций.АвтоВысотаЯчейки = Истина;
		ПолеРеакций.Доступность      = Ложь;
		ПолеРеакций.Ширина           = 23;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыРазмещения() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ПолеИлиТаблица");
	Возврат Результат;
	
КонецФункции

Процедура ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	Перем КлючСтроки;
	
	Для Каждого Строка Из Строки Цикл
		КлючСтроки = Строка.Ключ;
		Прервать;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(КлючСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = КлючСтроки.Метаданные();
	Если Не РКЦ_Реакции.НастройкиРеакцийОбъекта(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	
	ДанныеРеакций = РКЦ_РеакцииСлужебныйПовтИсп.ДанныеРеакций();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеакцииОбъектов.Идентификатор КАК Идентификатор,
	|	РеакцииОбъектов.Реакция КАК Реакция,
	|	КОЛИЧЕСТВО(РеакцииОбъектов.Реакция) КАК Число,
	|	МАКСИМУМ(РеакцииОбъектов.Пользователь = &ТекущийПользователь) КАК Наша
	|ПОМЕСТИТЬ РеакцииОбъекта
	|ИЗ
	|	РегистрСведений.РКЦ_РеакцииОбъектов КАК РеакцииОбъектов
	|ГДЕ
	|	РеакцииОбъектов.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных
	|		И РеакцииОбъектов.Идентификатор В(&Идентификаторы)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеакцииОбъектов.Идентификатор,
	|	РеакцииОбъектов.Реакция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеакцииОбъекта.Идентификатор КАК Идентификатор,
	|	РеакцииОбъекта.Число КАК Число,
	|	РеакцииОбъекта.Наша КАК ЕстьНаша,
	|	РеакцииОбъекта.Реакция КАК Реакция,
	|	РКЦ_Реакции.Ссылка ЕСТЬ НЕ NULL КАК ЭтоПользовательская
	|ИЗ
	|	РеакцииОбъекта КАК РеакцииОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РКЦ_Реакции КАК РКЦ_Реакции
	|		ПО РеакцииОбъекта.Реакция = РКЦ_Реакции.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(ЕстьНаша)
	|ПО
	|	Идентификатор";
	
	Идентификаторы = Новый Массив;
	Для Каждого Ключ Из Строки.ПолучитьКлючи() Цикл
		Идентификаторы.Добавить(Ключ.УникальныйИдентификатор());
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектов.Следующий() Цикл
		
		СтрокаСписка = Строки[Менеджер.ПолучитьСсылку(ВыборкаОбъектов.Идентификатор)];
		
		СписокРеакций = Новый СписокЗначений;
		ВыборкаРеакций = ВыборкаОбъектов.Выбрать();
		Пока ВыборкаРеакций.Следующий() Цикл
			
			СвойстваРеакции = СвойстваРеакции(ВыборкаРеакций.Реакция, ДанныеРеакций);
			
			Если СвойстваРеакции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СписокРеакций.Добавить(
				СвойстваРеакции.Представление,
				ВыборкаРеакций.Число, ,
				СвойстваРеакции.Картинка
			);
			
		КонецЦикла;
		
		Если СтрокаСписка.Данные.Свойство("РКЦ_Реакции") Тогда
			СтрокаСписка.Данные["РКЦ_Реакции"] = СписокРеакций;
			СтрокаСписка.Оформление["РКЦ_Реакции"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПоля);
			Если ВыборкаОбъектов.ЕстьНаша Тогда
				СтрокаСписка.Оформление["РКЦ_Реакции"].УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонАктивногоВариантаВторой);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиРеакцийОбъекта(Знач Объект, Настройки = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		Объект = Метаданные.НайтиПоПолномуИмени(Объект);
	КонецЕсли;
	
	Настройки = РКЦ_РеакцииСлужебныйПовтИсп.НастройкиОбъектов()[Объект];
	Возврат Настройки <> Неопределено;
	
КонецФункции

Функция СвойстваРеакции(Знач Идентификатор, ДанныеРеакций = Неопределено) Экспорт
	
	Если ДанныеРеакций = Неопределено Тогда
		ДанныеРеакций = РКЦ_РеакцииСлужебныйПовтИсп.ДанныеРеакций();
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("СправочникСсылка.РКЦ_Реакции") Тогда
		Идентификатор = Строка(Идентификатор.УникальныйИдентификатор());
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		Возврат ДанныеРеакций.ПользовательскиеРеакции[Идентификатор];
	Иначе
		Возврат ДанныеРеакций.ПредопределенныеРеакции[Идентификатор];
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьДеревоВсехРеакций(СтрокиДерева) Экспорт
	
	СтрокиНаборов = Новый Соответствие;
	
	ДанныеРеакций = РКЦ_РеакцииСлужебныйПовтИсп.ДанныеРеакций();
	
	Для Каждого СвойстваРеакции Из ДанныеРеакций.ПредопределенныеРеакции Цикл
		Свойства = СвойстваРеакции.Значение;
		
		Набор = СтрокиНаборов.Получить(Свойства.ДанныеНабора.ИмяРасширения);
		Если Набор = Неопределено Тогда
			Набор = СтрокиДерева.Добавить();
			Набор.Представление = Свойства.ДанныеНабора.Наименование;
			СтрокиНаборов.Вставить(Свойства.ДанныеНабора.ИмяРасширения, Набор);
		КонецЕсли;
		
		СтрокаРеакции = Набор.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРеакции, Свойства);
	КонецЦикла;
	
	НаборПользовательских = СтрокиДерева.Добавить();
	НаборПользовательских.Представление = нСтр("ru='Пользовательские реакции'", "ru");
	Для Каждого СвойстваРеакции Из ДанныеРеакций.ПользовательскиеРеакции Цикл
		СтрокаРеакции = НаборПользовательских.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРеакции, СвойстваРеакции.Значение);
	КонецЦикла;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// БиблиотекаСтандартныхПодсистем.ПодключаемыеКоманды

Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	ИспользоватьРеакции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции"
	);
	Если Не ИспользоватьРеакции Тогда
		Возврат;
	КонецЕсли;
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя         = "РКЦ_Реакции";
	Вид.ИмяПодменю  = "ПодменюОтреагировать";
	Вид.Заголовок   = НСтр("ru = 'Отреагировать'");
	Вид.Картинка    = БиблиотекаКартинок.РКЦ_ПодсистемаРеакции;
	Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Вид.Порядок     = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПоложениеКоманды", 50
	);
	
КонецПроцедуры

Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	ИспользоватьРеакции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ИспользоватьРеакции", Истина
	);
	Если Не ИспользоватьРеакции Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеТипы = Новый Массив;
	Для Каждого Источник Из Источники.Строки Цикл
		Если РКЦ_Реакции.НастройкиРеакцийОбъекта(Источник.ПолноеИмя) Тогда
			ДоступныеТипы.Добавить(Источник.ТипСсылкиДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеТипы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = Новый ОписаниеТипов(ДоступныеТипы);
	
	ТолькоВоВсехДействиях = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "РасполагатьКомандуТолькоВБыстрыхДействиях", Истина
	);
	
	ОбщиеСвойства = Новый Структура;
	ОбщиеСвойства.Вставить("Вид",                   "РКЦ_Реакции");
	ОбщиеСвойства.Вставить("ТолькоВоВсехДействиях", ТолькоВоВсехДействиях);
	ОбщиеСвойства.Вставить("МножественныйВыбор",    Ложь);
	ОбщиеСвойства.Вставить("РежимЗаписи",           "НеЗаписывать");
	ОбщиеСвойства.Вставить("ТипПараметра",          ТипПараметра);
	ОбщиеСвойства.Вставить("Важность",              "Важное");
	
	СписокИспользуемыхРеакций = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "СписокИспользуемыхРеакций", Новый Массив
	);
	
	Если СписокИспользуемыхРеакций.Количество() > 0 Тогда
		
		ДанныеРеакций = РКЦ_РеакцииСлужебныйПовтИсп.ДанныеРеакций();
		ПользовательскиеРеакции = ДанныеРеакций.ПользовательскиеРеакции;
		ПредопределенныеРеакции = ДанныеРеакций.ПредопределенныеРеакции;
		
		Для Каждого Идентификатор Из СписокИспользуемыхРеакций Цикл
			
			КомандаРеакции = Команды.Добавить();
			КомандаРеакции.ФункциональныеОпции = "";//TODO: Опциональные пользовательские
			
			СвойстваРеакции = СвойстваРеакции(Идентификатор, ДанныеРеакций);
			Если СвойстваРеакции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(КомандаРеакции, ОбщиеСвойства);
			КомандаРеакции.Идентификатор = СвойстваРеакции.Значение;
			КомандаРеакции.Представление = СвойстваРеакции.Представление;
			Картинка = СвойстваРеакции.Картинка;
			Если Картинка.Вид <> ВидКартинки.Абсолютная Тогда // Ограничение платформы 8.3.27.1606
				КомандаРеакции.Картинка = Картинка;
			КонецЕсли;
			КомандаРеакции.Обработчик = "РКЦ_РеакцииКлиент.Отреагировать";
			КомандаРеакции.Важность = "Важное";
			КомандаРеакции.ТипПараметра = ТипПараметра;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщиеСвойства.Вставить("Важность", "СмТакже");
	
	КомандаВсе = Команды.Добавить();
	ЗаполнитьЗначенияСвойств(КомандаВсе, ОбщиеСвойства);
	КомандаВсе.Представление = нСтр("ru='Все реакции...'", "ru");
	КомандаВсе.Обработчик    = "РКЦ_РеакцииКлиент.ВыбратьИзВсехРеакций";
	
	КомандаУдалить = Команды.Добавить();
	ЗаполнитьЗначенияСвойств(КомандаУдалить, ОбщиеСвойства);
	КомандаУдалить.Представление = нСтр("ru='Удалить реакцию'", "ru");
	КомандаУдалить.Обработчик    = "РКЦ_РеакцииКлиент.УдалитьРеакцию";
	КомандаУдалить.Картинка      = БиблиотекаКартинок.ЗакрытьОтборДинамическогоСписка;
	
КонецПроцедуры


// БиблиотекаСтандартныхПодсистем.СерверныеОповещения

// Не используется
Процедура ПриОтправкеСерверногоОповещения(ИмяОповещения, ВариантыПараметров) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
