
&НаСервереБезКонтекста
Процедура ДСПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РКЦ_РеакцииОбъектов.Объект КАК Объект,
	|	РКЦ_РеакцииОбъектов.Реакция КАК Реакция,
	|	1 КАК Число
	|ИЗ
	|	РегистрСведений.РКЦ_РеакцииОбъектов КАК РКЦ_РеакцииОбъектов
	|ГДЕ
	|	РКЦ_РеакцииОбъектов.Объект В(&Объекты)
	|ИТОГИ
	|	КОЛИЧЕСТВО(Число)
	|ПО 
	|	Объект
	|	Реакция";
	
	Запрос.УстановитьПараметр("Объекты", Строки.ПолучитьКлючи());
	
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектов.Следующий() Цикл
		СтрокаСписка = Строки[ВыборкаОбъектов.Объект];
		
		СписокРеакций = Новый СписокЗначений;
		ВыборкаРеакций = ВыборкаОбъектов.Выбрать();
		Пока ВыборкаРеакций.Следующий() Цикл
			СписокРеакций.Добавить(ВыборкаРеакций.Реакция, ВыборкаРеакций.Число, , );
		КонецЦикла;
		СтрокаСписка.Данные["РКЦ_Реакции"] = СписокРеакций;
		
	КонецЦикла;
	
КонецПроцедуры
