
#Область СлужебныйПрограммныйИнтерфейс
 
Функция ОбъектыСРеакциями() Экспорт
	
	СвойстваОбъектовПодсистемы = Новый ТаблицаЗначений;
	СвойстваОбъектовПодсистемы.Колонки.Добавить("Метаданные");
	СвойстваОбъектовПодсистемы.Колонки.Добавить("РеквизитПолучательОповещения", Новый ОписаниеТипов("Строка"));
	
	РКЦ_РеакцииПереопределяемый.ПриОпределенииОбъектовСРеакциями(СвойстваОбъектовПодсистемы);
	
	Результат = Новый Соответствие;
	
	Для Каждого СвойстваОбъекта Из СвойстваОбъектовПодсистемы Цикл
		СтруктураСвойств = Новый Структура("РеквизитПолучательОповещения");
		ЗаполнитьЗначенияСвойств(СтруктураСвойств, СвойстваОбъекта);
		Результат.Вставить(СвойстваОбъекта.Метаданные, СвойстваОбъекта);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

Функция ДанныеРеакций() Экспорт
	
	Результат = Новый Структура("ПредопределенныеРеакции, ПользовательскиеРеакции");
	
	ПредопределенныеРеакции = Новый Соответствие;
	
	НаборыРеакций = ПараметрыСеанса.РКЦ_ПодключенныеНаборыРеакций;
	
	Для Каждого Набор Из НаборыРеакций Цикл
		
		Попытка
			РеакцииНабора = ОбщегоНазначения.ВызватьФункциюКонфигурации(Набор.ИмяМодуля + ".ОписаниеРеакцийНабора");
		Исключение
			ТекстСообщения = нСтр("ru='Ошибка при получении описания реакций набора. Скорее всего модуль набора реакций не содержит экспортируемый метод ""ОписаниеРеакцийНабора"".'", "ru");
			ЗаписьЖурналаРегистрации(
				"Реакции.Описание реакций набора.Получение описания",
				УровеньЖурналаРегистрации.Ошибка, ,
				Набор.ИмяМодуля,
				ТекстСообщения + Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			// TODO: Оповещение на клиент
			Продолжить;
		КонецПопытки;
		
		Для Каждого Реакция Из РеакцииНабора Цикл
			
			СвойстваРеакции = РКЦ_РеакцииСлужебный.СтруктураСвойствРеакции();
			ЗаполнитьЗначенияСвойств(СвойстваРеакции, Реакция);
			СвойстваРеакции.Картинка = БиблиотекаКартинок[Реакция.Значение];
			
			ПредопределенныеРеакции.Вставить(Реакция.Значение, Новый ФиксированнаяСтруктура(СвойстваРеакции));
			
		КонецЦикла;
		
	КонецЦикла;
	Результат.ПредопределенныеРеакции = Новый ФиксированноеСоответствие(ПредопределенныеРеакции);
	
	// Пользовательские реакции
	ПользовательскиеРеакции = Новый Соответствие;
	
	ПользовательскаяРеакция = Справочники.РКЦ_Реакции.Выбрать();
	Пока ПользовательскаяРеакция.Следующий() Цикл
		
		Картинка = ПользовательскаяРеакция.Картинка.Получить();
		
		Если Картинка.Высота() > 64 Или Картинка.Ширина() > 64 Тогда
			Обрабатываемая = Новый ОбрабатываемаяКартинка(Картинка);
			Обрабатываемая.УстановитьРазмер(64, 64);
			Картинка = Обрабатываемая.ПолучитьКартинку();
		КонецЕсли;
		
		УникальныйИдентификатор = Строка(ПользовательскаяРеакция.Ссылка.УникальныйИдентификатор());
		СвойстваРеакции = РКЦ_РеакцииСлужебный.СтруктураСвойствРеакции(
			УникальныйИдентификатор,
			ПользовательскаяРеакция.Наименование);
		СвойстваРеакции.Картинка = Картинка;
		СвойстваРеакции.Вставить("Ссылка", ПользовательскаяРеакция.Ссылка);
		
		ПользовательскиеРеакции.Вставить(УникальныйИдентификатор, Новый ФиксированнаяСтруктура(СвойстваРеакции));
		
	КонецЦикла;
	Результат.ПользовательскиеРеакции = Новый ФиксированноеСоответствие(ПользовательскиеРеакции);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция НастройкиРеакций() Экспорт
	
	ПерсональныеНастройки = Новый Структура;
	
	РКЦ_РеакцииСлужебный.ДобавитьНастройкиРеакций(ПерсональныеНастройки);
	
	Возврат Новый ФиксированнаяСтруктура(ПерсональныеНастройки);
	
КонецФункции

Функция ПолучатьОповещения(ИмяПользователя = "") Экспорт
	
	ПолучатьОповещения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"РКЦ_ПользовательскиеНастройкиРеакций", "ПолучатьОповещения", , , ИмяПользователя
	);
	
	Если ПолучатьОповещения = Неопределено Тогда
		ПолучатьОповещения = Истина;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"РКЦ_ПользовательскиеНастройкиРеакций", "ПолучатьОповещения", ПолучатьОповещения, , ИмяПользователя);
	КонецЕсли;
	
	Возврат ПолучатьОповещения;
	
КонецФункции

#Область Свернуть

// Не используется. Сделано через СерверныеОповещения
//Функция ИдентификаторСлужебногоОбсуждения() Экспорт
//	
//	КлючОбщегоОбсуждения = "РКЦ_";
//	
//	УстановитьПривилегированныйРежим(Истина);
//	Попытка
//		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбщегоОбсуждения);
//		Создано = Ложь;
//		Если Обсуждение = Неопределено Тогда
//			Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
//			Обсуждение.Отображаемое = Ложь;
//			Обсуждение.Ключ = КлючОбщегоОбсуждения;
//			Обсуждение.Участники.Добавить(СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения);
//			Попытка
//				Обсуждение.Записать();
//				Создано = Истина;
//			Исключение
//				Создано = Ложь;
//			КонецПопытки;
//			Если Не Создано Тогда
//				СуществующееОбсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбщегоОбсуждения);
//				Если СуществующееОбсуждение <> Неопределено Тогда
//					Обсуждение = СуществующееОбсуждение;
//				Иначе
//					Обсуждение.Записать();
//					Создано = Истина;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		Если Не Создано И Обсуждение.Отображаемое Тогда
//			Обсуждение.Отображаемое = Ложь;
//			Обсуждение.Записать();
//		КонецЕсли;
//	Исключение
//		ИнформацияОбОшибке = ИнформацияОбОшибке();
//		ЗаписьЖурналаРегистрации(
//			НСтр("ru = 'Серверные оповещения.Ошибка создания общего обсуждения'",
//				ОбщегоНазначения.КодОсновногоЯзыка()),
//			УровеньЖурналаРегистрацииОшибкиСВ(ИнформацияОбОшибке),,,
//			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
//		Возврат Неопределено;
//	КонецПопытки;
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	Возврат Обсуждение.Идентификатор;
//	
//КонецФункции
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти