
&НаСервере
Процедура РКЦ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПараметрыРазмещения = РКЦ_Реакции.ПараметрыРазмещения();
	ПараметрыРазмещения.ПолеИлиТаблица = Элементы.Список;
	РКЦ_Реакции.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура РКЦ_СписокПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	
	РКЦ_Реакции.ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

